JavaClient/JavaClient.org
* DONE PC端的Client和开发板上的Server                                    :一个模型:
CLOSED: [2012-09-05 三 12:01]
** DONE 程序的测试
CLOSED: [2012-09-05 三 12:12]
- 在一台机器上的两个控制台下，分别运行服务端和客户端
- 在客户端发送字符'1'，控制LED1的亮灭
- 在客户端发送字符'2'，控制LED2的亮灭
- 在客户端发送字符'3'，控制LED3的亮灭
- 在客户端发送字符'4'，控制LED4的亮灭
- 在客户端发送字符'q'，退出测试程序
- 其他输入为非法输入，服务端控制台打印"order error"，并等待下次输入
- 在两个不同的PC上测试时，只需要改变java客户端的IP地址为对应服务端的IP地址，后续在板子上测试时改为板子的IP
** DONE Server.c
CLOSED: [2012-09-05 三 12:01]
- 开发板上服务端的C代码的模型，调用了Linux的有关Socket的系统调用
*** 使用Socket连接并接收的代码段
- 目前使用了Linux的Socket系统调用，后续Linux系统调用可以被实验代码中lwip所实现的Socket（sockets.c中提供的的接口函数）替代，使其操作系统无关
*** 控制LED的代码段
- 目前简单的在控制台下打印控制LED的语句，后续使用实验代码中的控制LED亮灭的函数替代打印语句
** DONE Client.java
CLOSED: [2012-09-05 三 12:01]
- PC客户端的java代码，在Windows和Linux下均可以运行
** DONE Client.c
CLOSED: [2012-09-05 三 12:01]
- 测试用的一个PC客户端的C代码，调用了Linux的有关Socket的系统调用
*** 使用Socket连接并接收的代码段
- 目前使用了Linux的Socket系统调用，此代码可由java版的客户端程序代替，java版的客户端程序在Windows和Linux下均可以运行

