JavaClient/JavaClient.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>JavaClient</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="JavaClient"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-05 15:53:08 CST"/>
<meta name="author" content="YoungLee"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">JavaClient</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 PC端的Client和开发板上的Server</a>
<ul>
<li><a href="#sec-1-1">1.1 程序的测试</a></li>
<li><a href="#sec-1-2">1.2 Server.c</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 使用Socket连接并接收的代码段</a></li>
<li><a href="#sec-1-2-2">1.2.2 控制LED的代码段</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Client.java</a></li>
<li><a href="#sec-1-4">1.4 Client.c</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 使用Socket连接并接收的代码段</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> PC端的Client和开发板上的Server &nbsp;&nbsp;&nbsp;<span class="tag"><span class="____">一个模型</span></span></h2>
<div class="outline-text-2" id="text-1">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2012-09-05 三 12:01</span></span><br/>
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> 程序的测试</h3>
<div class="outline-text-3" id="text-1-1">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2012-09-05 三 12:12</span></span><br/>
</p><ul>
<li>在一台机器上的两个控制台下，分别运行服务端和客户端
</li>
<li>在客户端发送字符'1'，控制LED1的亮灭
</li>
<li>在客户端发送字符'2'，控制LED2的亮灭
</li>
<li>在客户端发送字符'3'，控制LED3的亮灭
</li>
<li>在客户端发送字符'4'，控制LED4的亮灭
</li>
<li>在客户端发送字符'q'，退出测试程序
</li>
<li>其他输入为非法输入，服务端控制台打印"order error"，并等待下次输入
</li>
<li>在两个不同的PC上测试时，只需要改变java客户端的IP地址为对应服务端的IP地址，后续在板子上测试时改为板子的IP
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> Server.c</h3>
<div class="outline-text-3" id="text-1-2">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2012-09-05 三 12:01</span></span><br/>
</p><ul>
<li>开发板上服务端的C代码的模型，调用了Linux的有关Socket的系统调用
</li>
</ul>


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 使用Socket连接并接收的代码段</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li>目前使用了Linux的Socket系统调用，后续Linux系统调用可以被实验代码中lwip所实现的Socket（sockets.c中提供的的接口函数）替代，使其操作系统无关
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 控制LED的代码段</h4>
<div class="outline-text-4" id="text-1-2-2">

<ul>
<li>目前简单的在控制台下打印控制LED的语句，后续使用实验代码中的控制LED亮灭的函数替代打印语句
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> Client.java</h3>
<div class="outline-text-3" id="text-1-3">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2012-09-05 三 12:01</span></span><br/>
</p><ul>
<li>PC客户端的java代码，在Windows和Linux下均可以运行
</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> Client.c</h3>
<div class="outline-text-3" id="text-1-4">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2012-09-05 三 12:01</span></span><br/>
</p><ul>
<li>测试用的一个PC客户端的C代码，调用了Linux的有关Socket的系统调用
</li>
</ul>


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 使用Socket连接并接收的代码段</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li>目前使用了Linux的Socket系统调用，此代码可由java版的客户端程序代替，java版的客户端程序在Windows和Linux下均可以运行
</li>
</ul>


</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-05 15:53:08 CST</p>
<p class="author">Author: YoungLee</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
